In [1]:
# Pandas => Panel data 
import numpy as np
import pandas as pd

from pandas import Series , DataFrame

# Series

In [2]:
# Similar to list 
# It has index listing before each row
# Can provide the name for index
# can get value using index , Index Name


series_1 = Series([1,2,3,4,5.5,6,7])
series_1

0    1.0
1    2.0
2    3.0
3    4.0
4    5.5
5    6.0
6    7.0
dtype: float64

In [3]:
series_2 = Series([1,2,3],index=['Row1','Row2','Row3'])
series_2

Row1    1
Row2    2
Row3    3
dtype: int64

In [4]:
 # Retriesve data from series    
series_2[1]

2

In [5]:
series_2['Row2']

2

In [6]:
# when we use slice operator it start from starting from start index, and end excluding ending index 
series_1[2:5]

2    3.0
3    4.0
4    5.5
dtype: float64

In [7]:
# select data by passing the lost of index
series_1[[2,4,5]]

2    3.0
4    5.5
5    6.0
dtype: float64

# DataFrame
### Similar to Series 
### It has index listing before each row
### It has column listing 
### Can provide the name for index and column
### can get value using index , Index Name, column Name , Indedex-Column

In [8]:
np.floor(np.random.rand(36).reshape(6,6)*100)

array([[49., 53., 44., 55., 19., 76.],
       [12., 22., 93., 68., 33., 50.],
       [ 4., 33., 59., 72., 77., 52.],
       [59., 44., 69., 28., 78., 64.],
       [50., 68., 90., 86.,  5.,  6.],
       [60., 10., 37., 89., 62., 57.]])

In [9]:
df_obj=DataFrame(np.floor(np.random.rand(36).reshape(6,6)*100))
df_obj

      0     1     2     3     4     5
0  37.0  94.0  70.0  69.0  88.0  91.0
1  73.0  36.0  41.0  72.0  43.0   5.0
2  61.0  23.0  24.0  15.0  50.0  40.0
3  15.0  50.0  84.0  81.0   1.0  48.0
4  14.0  45.0  28.0  89.0  48.0  84.0
5   6.0   9.0  50.0  87.0  11.0  16.0

In [10]:
ind = ['row1','row2','row3','row4','row5','row6'] 
col = ['col1','col2','col3','col4','col5','col6'] 


df_obj2 = DataFrame(np.floor(np.random.rand(36).reshape(6,6)*100),index=ind,columns=col)
df_obj2

      col1  col2  col3  col4  col5  col6
row1  26.0  12.0  36.0  61.0  61.0  39.0
row2  99.0  44.0  61.0  76.0  34.0  68.0
row3  26.0  77.0  95.0  10.0  64.0  20.0
row4  45.0  65.0  18.0  89.0  17.0   9.0
row5   2.0  56.0  61.0  58.0  94.0  15.0
row6  46.0  66.0  54.0  68.0  59.0  66.0

In [11]:
df_obj2.loc['row3','col3'] #Using Location

95.0

In [12]:
df_obj2.loc[['row3','row4'],['col3','col4','col5']]

      col3  col4  col5
row3  95.0  10.0  64.0
row4  18.0  89.0  17.0

In [13]:
df_obj2.iloc[1,3] #Using index

76.0

In [14]:
#Sliceing
df_obj2.loc[  : , 'col4': ]

      col4  col5  col6
row1  61.0  61.0  39.0
row2  76.0  34.0  68.0
row3  10.0  64.0  20.0
row4  89.0  17.0   9.0
row5  58.0  94.0  15.0
row6  68.0  59.0  66.0

'pwd' is not recognized as an internal or external command,
operable program or batch file.